#номер 1
vvod  = число с  плавающей запятой ( ввод ())
для  я  в  диапазоне ( 1 , 11 ):
    печать (( i  /  10 ), "кг конфет =" , round ( vvod  * ( i  /  10 ), 2 ), "руб" )


#номер 2
результат  =  1
ввод  =  целое ( ввод ())
для  i  в  диапазоне ( 1 , vvod  +  1 ):
    результат  =  результат  * ( 1  +  я  /  10 )
распечатать ( раунд ( произ , 3 ))


# номер 3
ввод  =  целое ( ввод ())
сумма  =  0
для  i  в  диапазоне ( 1 , 2  *  vvod , 2 ):
    сумма  +=  я
    печать ( сумма )


#номер 4
а  = число с  плавающей запятой ( ввод ())
N  =  целое ( ввод ())
сумма  =  0
для  i  в  диапазоне ( 0 , N  +  1 ):
    сумма  +=  а ** я
печать ( сумма )

#номер 5
а  = число с  плавающей запятой ( ввод ())
N  =  целое ( ввод ())
сумма  =  1
мин  =  1
для  я  в  диапазоне ( 0 , N ):
    мин  *=  - а
    сумма  +=  мин .
печать ( сумма )
