#номер 1
a  =  int ( ввод ( "Введите число А" ))
b  =  int ( ввод ( "Введите число B" ))
для  i  в  диапазоне ( a , b  +  1 ):
    печать ( ул ( я ) *  я )

#номер 2
a  =  int ( ввод ( "Введите число А" ))
b  =  int ( ввод ( "Введите число B" ))
остаток  =  а
в то время как  ostatok  >=  0 :
    остаток  -=  б
печать ( остаток  +  б )

# номер 3
n  =  int ( ввод ( "Введите число N" ))
сумма  =  0
к  =  0
а  сумма  <  n :
    к  +=  1
    сумма  +=  k
печать ( сумма , к )

#номер 4
с  =  1000
к  =  0
p  =  int ( input ( "Введите P (0 < p < 25)" ))
в то время как  с  <=  1100 :
    с  +=  с  * ( р  /  100 )
    к  +=  1
напечатать ( к , с )

#номер 5
a  =  int ( ввод ( "Введите число А" ))
b  =  int ( ввод ( "Введите число B" ))
а  ! = б :  
    если  а  >  б :
        а  -=  б
    еще :
        б  -=  а
распечатать ( а )

#номер 6
фиб1  =  1
фибо2  =  1
к  =  2
ф  =  0
n  =  int ( ввод ( "Введите N" ))
в то время как  f  <  n :
    к  +=  1
    f  =  фиб2  +  фиб1
    выдумка2  =  выдумка1
    фиб1  =  f
распечатать ( к )
